{
  "offset": 0,
  "data": [
    {
      "citingPaper": {
        "paperId": "cd6286188579aeff34ea83ae7f2055f80073f87f",
        "title": "Research on the Rapid Recognition Method of Electric Bicycles in Elevators Based on Machine Vision",
        "abstract": "People are gradually coming around to the idea of living a low-carbon lifestyle and using green transportation, and given the severe urban traffic congestion, electric bicycle commuting has taken over as the preferred mode of short-distance transportation for many. Since batteries are used to power electric bicycles, there are no greenhouse gas emissions while they are in use, which is more in line with the requirement for sustainable development around the world. The public has been increasingly concerned about the safety issues brought on by electric bicycles as a result of the industry’s quick development and the rapid increase in the number of electric bicycles worldwide. The unsafe operation of the elevator and the safety of the building have been seriously compromised by the unauthorized admission of electric bicycles into the elevator. To meet the need for fast detection and identification of electric bicycles in elevators, we designed a modified YOLOv5-based identification approach in this study. We propose the use of the EIoU loss function to address the occlusion problem in electric bicycle recognition. By considering the interaction ratio and overlap loss of the target frames, we are able to enhance localization accuracy and reduce the missed detection rate of occluded targets. Additionally, we introduce the CBAM attention mechanism in both the backbone and head of YOLOv5 to improve the expressive power of feature maps. This allows the model to prioritize important regions of the target object, leading to improved detection accuracy. Furthermore, we utilize the CARAFE operator during upsampling instead of the nearest operator in the original model. This enables our model to recover details and side information more accurately, resulting in finer sampling results. The experimental results demonstrate that our improved model achieves an mAP of 86.35 percent, a recall of 81.8 percent, and an accuracy of 88.0 percent. When compared to the original model under the same conditions, our improved YOLOv5 model shows an average detection accuracy increase of 3.49 percent, a recall increase of 5.6 percent, and an accuracy increase of 3.5 percent. Tests in application scenarios demonstrate that after putting the model on the hardware platform Jeston TX2 NX, stable and effective identification of electric bicycles can be accomplished.",
        "year": 2023,
        "referenceCount": 30,
        "citationCount": 0,
        "influentialCitationCount": 0,
        "isOpenAccess": true,
        "fieldsOfStudy": null,
        "authors": [
          {
            "authorId": "2240341340",
            "name": "Zhike Zhao"
          },
          {
            "authorId": "2240140653",
            "name": "Songying Li"
          },
          {
            "authorId": "2240137712",
            "name": "Caizhang Wu"
          },
          {
            "authorId": "2240473923",
            "name": "Xiaobing Wei"
          }
        ]
      }
    },
    {
      "citingPaper": {
        "paperId": "1b4b8f6a5c3bdc57d4a5136240414de4e50a60a4",
        "title": "The Analysis of Tourist Satisfaction Integrating the Artistic Intelligence Convolutional Neural Network and Internet of Things Technology",
        "abstract": "Aiming at the limitations of existing fire detection technology and the multi-dimensional challenge of tourist satisfaction analysis, this study proposes a series of innovative methods and models. Regarding fire detection, Depth Separable Convolution (DSC) and multi-scale detection structure are introduced to improve the You Only Look Once version 3 (YOLOv3) model. Moreover, the DSC-Anchor-Isoft-Non Maximum Suppression-YOLO (DAI-YOLO) model is implemented for the fire detection of scenic spots. The experimental results show that the precision, recall, and average precision of the DAI-YOLO model are 92.1%, 84.2%, and 84.6%, respectively, compared with other models, a minimum increase of 4.1%, 8.8%, and 6.0%, with higher detection accuracy and performance. Based on the analysis of tourist satisfaction, a comprehensive index system is constructed using the grounded theory of text mining, and emotion analysis is integrated into the satisfaction evaluation to reveal tourists’ evaluation of scenic spots more comprehensively. According to the analysis, the environmental factor receives the highest satisfaction rating, reaching a positive rate of 98.78%. However, the satisfaction evaluation of scenic spot management is relatively low, accounting for 6.06% of the negative evaluation. The importance-satisfaction analysis reveals that the key factors affecting tourist satisfaction are traffic level, scenic spot tickets, and service. The results of this study provide valuable reference for the managers and researchers of scenic spots and are expected to contribute to the construction of a safer and more satisfying tourism experience.",
        "year": 2023,
        "referenceCount": 55,
        "citationCount": 0,
        "influentialCitationCount": 0,
        "isOpenAccess": true,
        "fieldsOfStudy": [
          "Computer Science"
        ],
        "authors": [
          {
            "authorId": "2244393800",
            "name": "He Yan"
          }
        ]
      }
    }
  ]
}