{
  "offset": 0,
  "next": 10,
  "data": [
    {
      "citedPaper": {
        "paperId": "09bbb194e29714cf4f365bc6865eab8879af1912",
        "title": "Comfy Smart Home using IoT",
        "abstract": null,
        "year": 2020,
        "referenceCount": 40,
        "citationCount": 13,
        "influentialCitationCount": 0,
        "isOpenAccess": false,
        "fieldsOfStudy": [
          "Computer Science"
        ],
        "authors": [
          {
            "authorId": "2129608925",
            "name": "Shivani Jadon"
          },
          {
            "authorId": "2129507629",
            "name": "Arnav Choudhary"
          },
          {
            "authorId": "1500401772",
            "name": "Himanshu Saini"
          },
          {
            "authorId": "2129834027",
            "name": "Utkarsh Dua"
          },
          {
            "authorId": "49933301",
            "name": "Nikhil Sharma"
          },
          {
            "authorId": "1491234510",
            "name": "I. Kaushik"
          }
        ]
      }
    },
    {
      "citedPaper": {
        "paperId": "7aa88bdb3da98ba5be76cc0190a55885996be70d",
        "title": "Architectural Model of Security Threats & theirCountermeasures in IoT",
        "abstract": "Internet of Things (IoT) depicts a future technology where devices establish a connection with internet for building the intelligent structural system and to implement self-configuration system IoT is an internetworking of devices which are physically present, function of that device is to sense the data In today’s scenario IoT involves with different technologies like blockchain, WSN and many more to give better results. Also, IoT has various implementations like in healthcare, wearables, farming etc. Main objective of IoT is to produce a helpful communication between any two heterogeneous devices, which are physically present at various locations with the help of technology of networking. Applications and implementations of IoT is increasing day-by-day, to secure and maintain Confidentiality, Integrity, Availability (CIA) and other parameters becomes very crucial. We have discussed the principles of IoT in this paper, then comparison between the IoT and Traditional IT services is being discussed. Appropriate techniques and mechanisms to build a secure framework for covering all the IoT layers is being shown in this paper. This paper also discusses about the privacy and security challenges faced during the designing of IoT network. Then the security measures proposed by various researchers is being highlighted in this paper, so as to make a reliable IoT network.",
        "year": 2019,
        "referenceCount": 10,
        "citationCount": 37,
        "influentialCitationCount": 1,
        "isOpenAccess": false,
        "fieldsOfStudy": [
          "Computer Science"
        ],
        "authors": [
          {
            "authorId": "118326739",
            "name": "Tanishq Varshney"
          },
          {
            "authorId": "46910850",
            "name": "Nikhil Sharma"
          },
          {
            "authorId": "1491234510",
            "name": "I. Kaushik"
          },
          {
            "authorId": "144907851",
            "name": "B. Bhushan"
          }
        ]
      }
    },
    {
      "citedPaper": {
        "paperId": "9b3ebb7bdfeb37cc5e18579fd680ef518afc728b",
        "title": "Artificial Intelligence and Machine Learning based Legal Application: The State-of-the-Art and Future Research Trends",
        "abstract": "The advancement of science and technology has facilitated adaptation of human intelligence into its computerized platform for logical analysis of any event. This porting of human intelligence to machine is known as Artificial Intelligence (AI). AI enhances human life since inception with the help of these intelligent machines, human potentials will be augmented in multiple spheres. An enormous improvement in this area of AI has been noticed in the past two decades that has given rise to expert systems. AI has huge impact on different fields of business, engineering, law, medicine, science, weather forecasting, etc. to enhance the quality and efficiency in our day to day life to solve complex problems. For the past few decades, AI has been playing an emerging role in the legal field and will definitely have an effect on the legal practices over the next few years. AI has the potential to analyses legal information based on semantics and make legal predictions from the legal data set, and hence it helps the judiciary system in automation thereby increasing the efficiency within affordable budget. For better understanding of the concept, in this paper authors have performed relevant survey on this field.",
        "year": 2019,
        "referenceCount": 22,
        "citationCount": 32,
        "influentialCitationCount": 0,
        "isOpenAccess": false,
        "fieldsOfStudy": [
          "Computer Science"
        ],
        "authors": [
          {
            "authorId": "81146140",
            "name": "Riya Sil"
          },
          {
            "authorId": "2090299849",
            "name": "Abhishek Roy"
          },
          {
            "authorId": "144907851",
            "name": "B. Bhushan"
          },
          {
            "authorId": "1491236648",
            "name": "A. Mazumdar"
          }
        ]
      }
    },
    {
      "citedPaper": {
        "paperId": "d65757906d5805a9c26d340b44416997d8abd123",
        "title": "Traffic control using V-2-V Based Method using Reinforcement Learning",
        "abstract": "Nowadays with the increase in advancement of traffic network methodology we have potentials to control traffic congestion and hindrance using huge range of traffic management strategies. Feasibly there are two most promising techniques proffered are chaos theory and reinforcement leaning techniques, the goal of this research technique is to make up a model that self-sufficiently learns by itself the optimal policy. In this paper, we use V-2-V based fuzzy node mechanism and chaos theory that notifies where the traffic could get clustered. On other hand, our reinforcement learning agent makes up discretions (signal status) for the proffered environment.",
        "year": 2019,
        "referenceCount": 14,
        "citationCount": 8,
        "influentialCitationCount": 0,
        "isOpenAccess": false,
        "fieldsOfStudy": [
          "Computer Science"
        ],
        "authors": [
          {
            "authorId": "1491243113",
            "name": "Moksh Grover"
          },
          {
            "authorId": "2064420820",
            "name": "Bharti Verma"
          },
          {
            "authorId": "46910850",
            "name": "Nikhil Sharma"
          },
          {
            "authorId": "1491234510",
            "name": "I. Kaushik"
          }
        ]
      }
    },
    {
      "citedPaper": {
        "paperId": "331ab8b65a315be761ee7029cd6605724bab4923",
        "title": "Analysis of Various Machine Learning Algorithm for Cardiac Pulse Prediction",
        "abstract": "By applying machine learning algorithms, patterns are identified or recognized in the process of Pattern Recognition. On the grounds of prior knowledge, the data is collected and sorted. In this method, the raw data is transformed into a susceptible form which can be used by the machine. Electrocardiogram (ECG) Pattern Recognition is the main focus of this paper. ECG keeps a track of heart’s electrical activity. In the field of biometric it is used as a robust biometric. On the person, off the person and in the person, are the three categories for tracking and capturing signals. Only Off-the-person category in which there is no or minimal skin contact, is included in this paper. To analyze and implement data, six baseline methods are utilized. These baseline methods are applied two publicly available databases-CYBHi and UofT. Raw signals and spectrogram of heartbeat are used for studying about representing features. Various machine learning algorithms are also discussed. Implementation for predicting heartbeat as normal or abnormal and heart diseases, is performed.",
        "year": 2019,
        "referenceCount": 16,
        "citationCount": 13,
        "influentialCitationCount": 0,
        "isOpenAccess": false,
        "fieldsOfStudy": [
          "Computer Science"
        ],
        "authors": [
          {
            "authorId": "1491244612",
            "name": "Mahima Harjani"
          },
          {
            "authorId": "1491243113",
            "name": "Moksh Grover"
          },
          {
            "authorId": "46910850",
            "name": "Nikhil Sharma"
          },
          {
            "authorId": "1491234510",
            "name": "I. Kaushik"
          }
        ]
      }
    },
    {
      "citedPaper": {
        "paperId": "52e2fdf73048021714426a85c71e99bf767125b3",
        "title": "Evolution of IoT & Data Analytics using Deep Learning",
        "abstract": "In today’s world, we are surrounded by enormous devices that sense some sort of data and gives a particular output. To track the record and manage that data by connecting all devices in a network in such an efficient manner that it can be utilized in favour of mankind, this is what we call as Internet of Things. It is very difficult task to manage such a huge amount of data with great efficiency, but here the Internet of Things along with concepts of Deep Learning plays a vital role in successful completion of the task. In this paper, you are about see an absolute overview about the analytics that are used to maintain and process huge amount of input data using the concepts of Deep Learning in the very domain of Internet of Things. Firstly, we start by giving a brief description about Internet of Things and some characteristics and requirements possessed by it. We will also explain some major key factors that make deep learning a good choice for implementation of Internet of Things. Also, we have discussed about the concept of Big Data and what role it has in Internet of Things. We have evaluated some research attempts made in the very domain of Internet of Things and Deep Learning. Finally, we have explained some real-life applications and the concept behind them in this paper.",
        "year": 2019,
        "referenceCount": 26,
        "citationCount": 25,
        "influentialCitationCount": 0,
        "isOpenAccess": false,
        "fieldsOfStudy": [
          "Computer Science"
        ],
        "authors": [
          {
            "authorId": "1491241936",
            "name": "Ratik Tiwari"
          },
          {
            "authorId": "46910850",
            "name": "Nikhil Sharma"
          },
          {
            "authorId": "1491234510",
            "name": "I. Kaushik"
          },
          {
            "authorId": "1491238977",
            "name": "Archit Tiwari"
          },
          {
            "authorId": "144907851",
            "name": "B. Bhushan"
          }
        ]
      }
    },
    {
      "citedPaper": {
        "paperId": "44e5df18856ab646a1d5e0629c1b1e321ff191dd",
        "title": "Machine learning methods for IoT and their Future Applications",
        "abstract": "With the advent of rapid developments, large number of heterogeneous devices is able to connect with the help of IOT technology. Although IOT possess very complex architecture because of connectivity of variety of devices and services in the system. In this paper, a brief concept of urban IOT system is presented which are designed to support smart city and advanced communication technologies. Hence a comprehensive survey of architecture, technologies, and computational frameworks is provided for a smart IOT. It also discusses the major vulnerabilities and challenges faced by IOT and also present how machine learning is applied to IOT. Hence smart city is considered as the use case and it explains how various techniques are applied to data in order to extract great results with good efficiency.",
        "year": 2019,
        "referenceCount": 52,
        "citationCount": 27,
        "influentialCitationCount": 1,
        "isOpenAccess": false,
        "fieldsOfStudy": [
          "Computer Science"
        ],
        "authors": [
          {
            "authorId": "144245264",
            "name": "A. Rana"
          },
          {
            "authorId": "1456147509",
            "name": "Ayodeji Olalekan Salau"
          },
          {
            "authorId": "2109176049",
            "name": "Swati Gupta"
          },
          {
            "authorId": "47038339",
            "name": "S. Arora"
          }
        ]
      }
    },
    {
      "citedPaper": {
        "paperId": "1b33d1d8f2a2369341adbfe39d17c28b95a53b72",
        "title": "Medical Images Registration Concepts in the Context of Following Software Involving [ Simpleelastix+imageai ] for Iot/hpc Heterogeneous Environment/s – an Interesting Investigation Using Ai+python.",
        "abstract": "Medical Images Registration Concepts in the Context of Following Software involving [ SimpleElastix+IMAGEAI ] for IoT/HPC Heterogeneous Environment/s – An Interesting Investigation Using AI+Python. [ Exploring Simple Elastix : Medical Image Registration Library + ImageAI -Python based AI Library ]",
        "year": 2019,
        "referenceCount": 0,
        "citationCount": 1,
        "influentialCitationCount": 0,
        "isOpenAccess": false,
        "fieldsOfStudy": [
          "Computer Science"
        ],
        "authors": [
          {
            "authorId": "12354503",
            "name": "Nirmal Tej Kumar"
          }
        ]
      }
    },
    {
      "citedPaper": {
        "paperId": "2b52f54e9e2c70f3403ba5208fa8e232d4df463e",
        "title": "Security Concerns and Future Trends of Internet of Things",
        "abstract": "Every Technology in the market has some flaws and some advantages. Similar is the case of IoT (that is known as Internet of things). As its name suggests Internet of Things means transferring data over network in between connected devices without any human interaction and providing a promising environment for the actions that are to be performed. In IoT environment human interaction is bare minimum so chances of human error are also bare minimum which will help in increasing accuracy in various applications where humans are not able to perform well, machines can perform much better. IoT nowadays has become a basic necessity for humans and in future it will be going to become as essential for everyone as water is for humans to survive. In this paper topic of discussion is about various applications of IoT in various sectors, It's Security and privacy concerns which will throw the light on how various attacks and flaws could be prevented and then future research trends will be discussed.",
        "year": 2019,
        "referenceCount": 40,
        "citationCount": 21,
        "influentialCitationCount": 0,
        "isOpenAccess": false,
        "fieldsOfStudy": [
          "Computer Science"
        ],
        "authors": [
          {
            "authorId": "2054194675",
            "name": "Aman Arora"
          },
          {
            "authorId": "47677804",
            "name": "A. Kaur"
          },
          {
            "authorId": "144907851",
            "name": "B. Bhushan"
          },
          {
            "authorId": "1500401772",
            "name": "Himanshu Saini"
          }
        ]
      }
    },
    {
      "citedPaper": {
        "paperId": "1aa841072d1a20acd8e2fbc31e5e5d4759743220",
        "title": "Security Countermeasures in Web Based Application",
        "abstract": "With increase in use of internet, web-based applications are in high demand as they are used for many applications. With increase in its use, it is becoming prone to a number of attacks. Vulnerabilities exist in the application as the application is prone to a number of attacks. In this paper, we discussed about the processing of web applications, need and demand for web security on the network, different security testing methods as well as security mechanisms which helps the web applications to maintain its privacy.",
        "year": 2019,
        "referenceCount": 26,
        "citationCount": 11,
        "influentialCitationCount": 1,
        "isOpenAccess": false,
        "fieldsOfStudy": [
          "Computer Science"
        ],
        "authors": [
          {
            "authorId": "1390557213",
            "name": "Aditi Sharma"
          },
          {
            "authorId": "2111006642",
            "name": "Ankita Singh"
          },
          {
            "authorId": "46910850",
            "name": "Nikhil Sharma"
          },
          {
            "authorId": "1491234510",
            "name": "I. Kaushik"
          },
          {
            "authorId": "144907851",
            "name": "B. Bhushan"
          }
        ]
      }
    }
  ]
}