{
  "offset": 0,
  "next": 10,
  "data": [
    {
      "citedPaper": {
        "paperId": "67be529097d302fb1ee3b76397e9d8654abdf7c7",
        "title": "Addressing Complexities of Machine Learning in Big Data: Principles, Trends and Challenges from Systematical Perspectives",
        "abstract": "The concept of ‘big data’ has been widely discussed, and its value has been illuminated throughout a variety of domains. To quickly mine potential values and alleviate the ever-increasing volume of information, machine learning is playing an increasingly important role and faces more challenges than ever. Because few studies exist regarding how to modify machine learning techniques to accommodate big data environments, we provide a comprehensive overview of the history of the evolution of big data, the foundations of machine learning, and the bottlenecks and trends of machine learning in the big data era. More specifically, based on learning principals, we discuss regularization to enhance generalization. The challenges of quality in big data are reduced to the curse of dimensionality, class imbalances, concept drift and label noise, and the underlying reasons and mainstream methodologies to address these challenges are introduced. Learning model development has been driven by domain specifics, dataset complexities, and the presence or absence of human involvement. In this paper, we propose a robust learning paradigm by aggregating the aforementioned factors. Over the next few decades, we believe that these perspectives will lead to novel ideas and encourage more studies aimed at incorporating knowledge and establishing data-driven learning systems that involve both data quality considerations and human interactions.",
        "year": 2017,
        "referenceCount": 111,
        "citationCount": 13,
        "influentialCitationCount": 0,
        "isOpenAccess": true,
        "fieldsOfStudy": [
          "Computer Science"
        ],
        "authors": [
          {
            "authorId": "145346764",
            "name": "Qi Wang"
          },
          {
            "authorId": "2110782222",
            "name": "Xia Zhao"
          },
          {
            "authorId": "47513648",
            "name": "Jincai Huang"
          },
          {
            "authorId": "3038982",
            "name": "Yanghe Feng"
          },
          {
            "authorId": "152324585",
            "name": "Jiahao Su"
          },
          {
            "authorId": "32704368",
            "name": "Zhihao Luo"
          }
        ]
      }
    },
    {
      "citedPaper": {
        "paperId": "4d42cee9db1c4ffff8ca690cb020d23ae4f84b4d",
        "title": "Big Data in Intrusion Detection Systems and Intrusion Prevention Systems",
        "abstract": "This paper introduces network attacks, intrusion detection systems, intrusion prevention systems, and intrusion detection methods including signature-based detection and anomaly-based detection. Intrusion detection/prevention system (ID/PS) methods are compared. Some data mining and machine learning methods and their applications in intrusion detection are introduced. Big data in intrusion detection systems and Big Data analytics for huge volume of data, heterogeneous features, and real-time stream processing are presented. Challenges of intrusion detection systems and challenges posed by stream processing of big data in the systems are also discussed.",
        "year": 2017,
        "referenceCount": 34,
        "citationCount": 21,
        "influentialCitationCount": 1,
        "isOpenAccess": true,
        "fieldsOfStudy": [
          "Computer Science"
        ],
        "authors": [
          {
            "authorId": "48169695",
            "name": "Lidong Wang"
          }
        ]
      }
    },
    {
      "citedPaper": {
        "paperId": "7f0606c5698c35210a37d3db7376eb54ce49ea2b",
        "title": "Smart street lighting system: A platform for innovative smart city applications and a new frontier for cyber-security",
        "abstract": null,
        "year": 2016,
        "referenceCount": 3,
        "citationCount": 72,
        "influentialCitationCount": 1,
        "isOpenAccess": false,
        "fieldsOfStudy": [
          "Engineering"
        ],
        "authors": [
          {
            "authorId": "2068348591",
            "name": "Dong Jin"
          },
          {
            "authorId": "33857886",
            "name": "Christopher Hannon"
          },
          {
            "authorId": "2790591",
            "name": "Zhiyi Li"
          },
          {
            "authorId": "2066014443",
            "name": "Pablo Cortes"
          },
          {
            "authorId": "2373842",
            "name": "S. Ramaraju"
          },
          {
            "authorId": "2055734993",
            "name": "Patrick Burgess"
          },
          {
            "authorId": "37197121",
            "name": "N. Buch"
          },
          {
            "authorId": "1705137",
            "name": "M. Shahidehpour"
          }
        ]
      }
    },
    {
      "citedPaper": {
        "paperId": "3b9d6ee3fd6b082dd0df4cd05478c6a7cf13a367",
        "title": "Privacy-Preserving Access to Big Data in the Cloud",
        "abstract": "Cloud storage can simplify data management and reduce data maintenance costs. However, many users and companies hesitate to move their data to cloud storage because of security and privacy concerns about third-party cloud service providers. Oblivious RAM (ORAM) aims to enable privacy-preserving access to data stored in the cloud. This article offers a tutorial on ORAM and surveys recent literature. The authors also study the access load-balancing problem when applying ORAM to big data in the cloud. They propose heuristic algorithms to achieve access load balancing in both static and dynamic deployments.",
        "year": 2016,
        "referenceCount": 25,
        "citationCount": 29,
        "influentialCitationCount": 2,
        "isOpenAccess": true,
        "fieldsOfStudy": [
          "Computer Science"
        ],
        "authors": [
          {
            "authorId": "143667002",
            "name": "Peng Li"
          },
          {
            "authorId": "144123446",
            "name": "Song Guo"
          },
          {
            "authorId": "1718215",
            "name": "T. Miyazaki"
          },
          {
            "authorId": "143806694",
            "name": "Miao Xie"
          },
          {
            "authorId": "1713968",
            "name": "Jiankun Hu"
          },
          {
            "authorId": "143887379",
            "name": "W. Zhuang"
          }
        ]
      }
    },
    {
      "citedPaper": {
        "paperId": "a6cd07c92a29e072f039d71330432e3553007022",
        "title": "Privacy-Aware Big Data Warehouse Architecture",
        "abstract": "Along with the ever increasing growth in data collection and its mining, there is an increasing fear of compromising individual and population privacy. Several techniques have been proposed in literature to preserve privacy of collected data while storing and processing. In this paper, we propose a privacy-aware architecture for storing and processing data in a Big Data warehouse. In particular, we propose a flexible, extendable, and adaptable architecture that enforces user specified privacy requirements in the form of Embedded Privacy Agreements. The paper discusses the details of the architecture with some implementation details.",
        "year": 2016,
        "referenceCount": 16,
        "citationCount": 7,
        "influentialCitationCount": 0,
        "isOpenAccess": false,
        "fieldsOfStudy": [
          "Computer Science"
        ],
        "authors": [
          {
            "authorId": "2431667",
            "name": "Karthik Navuluri"
          },
          {
            "authorId": "1691219",
            "name": "R. Mukkamala"
          },
          {
            "authorId": "2111118594",
            "name": "Aftab Ahmad"
          }
        ]
      }
    },
    {
      "citedPaper": {
        "paperId": "352cf2e54105798d228cbd0962880bc19059a1cd",
        "title": "Applications of big data to smart cities",
        "abstract": null,
        "year": 2015,
        "referenceCount": 39,
        "citationCount": 694,
        "influentialCitationCount": 29,
        "isOpenAccess": true,
        "fieldsOfStudy": [
          "Computer Science"
        ],
        "authors": [
          {
            "authorId": "1978380",
            "name": "Eiman Al Nuaimi"
          },
          {
            "authorId": "1409212076",
            "name": "Hind Al Neyadi"
          },
          {
            "authorId": "145498019",
            "name": "N. Mohamed"
          },
          {
            "authorId": "1400163433",
            "name": "J. Al-Jaroodi"
          }
        ]
      }
    },
    {
      "citedPaper": {
        "paperId": "4906c171e2f1d2e7face93d774e8fcf450b352b6",
        "title": "Big Data - Security and Privacy",
        "abstract": null,
        "year": 2015,
        "referenceCount": 88,
        "citationCount": 151,
        "influentialCitationCount": 5,
        "isOpenAccess": false,
        "fieldsOfStudy": [
          "Computer Science"
        ],
        "authors": [
          {
            "authorId": "1743774",
            "name": "E. Bertino"
          },
          {
            "authorId": "88162783",
            "name": "E. Ferrari"
          }
        ]
      }
    },
    {
      "citedPaper": {
        "paperId": "9f03edafeedba743071f38510c8b5965b4844202",
        "title": "Dataless Data Mining: Association Rules-Based Distributed Privacy-Preserving Data Mining",
        "abstract": "Today, the desire to mine data from varied sources to discover behaviors and patterns of entities such as customers, diseases, and environmental conditions is on the rise. At the same time, the resistance to share data is also on the raise due to the increase in governmental regulations and individuals desire to preserve privacy. In this paper, we employ association rule mining to preserve individual data privacy without overly compromising on the accuracy of the global data mining task. Here, we describe the proposed methodology and show that the proposed scheme is privacy preserving. The methodology is tested using three commonly available data sets. The results validate our claims regarding the accuracy of synthetic data in its ability to represent original data without compromising privacy.",
        "year": 2015,
        "referenceCount": 19,
        "citationCount": 13,
        "influentialCitationCount": 0,
        "isOpenAccess": false,
        "fieldsOfStudy": [
          "Computer Science"
        ],
        "authors": [
          {
            "authorId": "145070406",
            "name": "V. Ashok"
          },
          {
            "authorId": "2431667",
            "name": "Karthik Navuluri"
          },
          {
            "authorId": "1870616",
            "name": "A. Alhafdhi"
          },
          {
            "authorId": "1691219",
            "name": "R. Mukkamala"
          }
        ]
      }
    },
    {
      "citedPaper": {
        "paperId": "318cb7946e263457f2123233c840f19ed08a1138",
        "title": "A Sticky Policy Framework for Big Data Security",
        "abstract": "Big data security is one of the hottest research topics in big data computing and service applications, because of the lack of research results and mature security technologies and solutions to provide adequate big data security. Big data security faces the need to effectively enforce security policies to protect sensitive data. Trying to satisfy this need, a security policy solution is presented in the paper. Firstly, an implementation independent and fine-grained policy meta-model is proposed for abstraction from underlying technologies and better reuse. Then, a sticky policy framework is adopted with policy enforcement and evaluation discussed in detail. Finally, a healthcare scenario is used to evaluate the process of policy modeling and enforcement.",
        "year": 2015,
        "referenceCount": 27,
        "citationCount": 26,
        "influentialCitationCount": 3,
        "isOpenAccess": false,
        "fieldsOfStudy": [
          "Computer Science"
        ],
        "authors": [
          {
            "authorId": "50342121",
            "name": "Shuyu Li"
          },
          {
            "authorId": "1689115",
            "name": "Zhang Tao"
          },
          {
            "authorId": "2154364225",
            "name": "J. Gao"
          },
          {
            "authorId": "2357371",
            "name": "Younghee Park"
          }
        ]
      }
    },
    {
      "citedPaper": {
        "paperId": "13f5588e5a745e15e4176fd6c47c8f5befc19605",
        "title": "Intrusion detection and Big Heterogeneous Data: a Survey",
        "abstract": null,
        "year": 2015,
        "referenceCount": 86,
        "citationCount": 263,
        "influentialCitationCount": 14,
        "isOpenAccess": true,
        "fieldsOfStudy": [
          "Computer Science"
        ],
        "authors": [
          {
            "authorId": "2690968",
            "name": "R. Zuech"
          },
          {
            "authorId": "1725285",
            "name": "T. Khoshgoftaar"
          },
          {
            "authorId": "145539319",
            "name": "Randall Wald"
          }
        ]
      }
    }
  ]
}